home-manager/emacs-config.org
#+PROPERTY: header-args 
#+STARTUP: showeverything
#+OPTIONS: ^:{}

* TABLE OF CONTENTS :TOC_5:
- [[#boilerplate-stuff][Boilerplate stuff]]
  - [[#path-to-the-custom-file][Path to the custom file]]
  - [[#set-up-packageel-to-work-with-various-sources][Set up package.el to work with various sources]]
  - [[#install-use-package][Install use-package]]
  - [[#packages-auto-updates][Packages auto updates]]
- [[#various-little-settings][Various little settings]]
  - [[#disable-all-the-gui-stuff][Disable all the GUI stuff.]]
  - [[#save-last-place-in-a-file][Save last place in a file]]
  - [[#restore-last-opened-file][Restore last opened file]]
  - [[#maximize-new-buffers][Maximize new buffers]]
  - [[#save-mini-buffer-history][Save mini buffer history]]
  - [[#never-loose-the-cursor][Never loose the cursor]]
  - [[#visual-bell][Visual bell]]
  - [[#make-esc-quit-prompts][Make ESC quit prompts]]
  - [[#turn-off-line-wrapping][Turn off line wrapping]]
  - [[#update-build-it-packages][Update build it packages]]
  - [[#smooth-scrolling][Smooth scrolling]]
- [[#save-everything-every-where-all-the-time][Save everything, every where all the time]]
- [[#detect-file-change-outside-of-emacs][Detect file change outside of Emacs]]
- [[#the-famous-which-key-package][The famous which-key package]]
- [[#package-for-easier-key-bindings][Package for easier key bindings]]
- [[#relative-line-numbers][Relative line numbers]]
- [[#icons-for-various-packages][Icons for various packages]]
- [[#on-the-fly-syntax-checking][On the fly syntax checking]]
- [[#flymake][Flymake]]
- [[#tree-sitter][Tree-sitter]]
- [[#org-mode][Org Mode]]
  - [[#auto-indentation-org-mode-style][Auto indentation Org Mode style]]
  - [[#various-little-settings-1][Various little settings]]
  - [[#org-modern][Org Modern]]
  - [[#enable-table-of-contents][Enable table of contents]]
  - [[#org-blocks-snippets][Org blocks snippets]]
  - [[#shortcut-for-save-and-tangle][Shortcut for save and tangle]]
  - [[#enumerate-headings][Enumerate headings]]
  - [[#images-inlining][Images inlining]]
- [[#restarting-emacs-from-emacs][Restarting Emacs from Emacs]]
- [[#font-and-ligatures][Font and ligatures]]
  - [[#font-settings][Font settings]]
  - [[#ligatures][Ligatures]]
- [[#dooms-mode-line][Doom's mode line]]
- [[#doom-one-theme][Doom One theme]]
- [[#scrolling][Scrolling]]
  - [[#disable-half-page-jumping][Disable half page jumping]]
  - [[#how-many-lines-at-a-time][How many lines at a time]]
  - [[#accelerate-scrolling][Accelerate scrolling]]
  - [[#scroll-window-under-mouse][Scroll window under mouse]]
- [[#debugging-the-config-file][Debugging the config file]]
- [[#undo-history-persistence][Undo history persistence]]
- [[#beautify][Beautify]]
- [[#projectile][Projectile]]
- [[#neotree][Neotree]]
- [[#dashboard---welcome-screen][Dashboard - welcome screen]]
- [[#evil-mode][Evil mode]]
  - [[#evil-itself][Evil itself]]
  - [[#evil-org][Evil org]]
  - [[#evil-collection][Evil collection]]
  - [[#evil-surround][Evil surround]]
  - [[#evil-goggles][Evil goggles]]
  - [[#evil-commentary][Evil commentary]]
  - [[#leader-key][Leader key]]
  - [[#search-behavior][Search behavior]]
  - [[#disable-the-arrow-keys][Disable the arrow keys]]
- [[#performance-tweaks][Performance tweaks]]
  - [[#startup][Startup]]
  - [[#runtime][Runtime]]
- [[#compilation-mode][Compilation mode]]
- [[#magit][Magit]]
- [[#languages][Languages]]
  - [[#haskell][Haskell]]
  - [[#nix][Nix]]
  - [[#elisp][Elisp]]
  - [[#rust][Rust]]
  - [[#yaml][Yaml]]
  - [[#markdown][Markdown]]
- [[#ivy][Ivy]]
- [[#snippets][Snippets]]
- [[#completion][Completion]]
- [[#lsp][LSP]]
  - [[#general-lsp-config][General LSP config]]
  - [[#key-bindings][Key bindings]]
- [[#git-auto-file-saver][Git auto file saver]]
- [[#git-modes][Git modes]]
- [[#emojis-support][Emojis support]]
- [[#mouse-support-in-terminal-emacs][Mouse support in terminal Emacs]]
- [[#displays-the-actual-color-of-a-hex-value-color][Displays the actual color of a hex value color]]
- [[#spell-checking][Spell checking]]
  - [[#using-flycheck-aspell][Using flycheck-aspell]]
  - [[#using-flyspell][Using Flyspell]]
- [[#better-elisp-help][Better Elisp help]]
- [[#brackets-colorization][Brackets colorization]]
- [[#better-term-mode-colors][Better term-mode colors]]
- [[#dired][Dired]]
- [[#git-status-on-the-fringe][Git status on the fringe]]
- [[#pretty-symbols][Pretty symbols]]
- [[#dim-irrelevant-buffers][Dim irrelevant buffers]]
- [[#todos][TODOs]]
  - [[#highlighting][Highlighting]]
  - [[#list-of-all-todos][List of all TODOs]]
- [[#slides-in-org-mode][Slides in Org Mode]]
- [[#games][Games]]

* Boilerplate stuff
  - [[#path-to-the-custom-file][Path to the custom file]]
  - [[#set-up-packageel-to-work-with-various-sources][Set up package.el to work with various sources]]
  - [[#install-use-package][Install use-package]]
  - [[#packages-auto-updates][Packages auto updates]]
- [[#various-little-settings][Various little settings]]
  - [[#disable-all-the-gui-stuff][Disable all the GUI stuff.]]
  - [[#save-last-place-in-a-file][Save last place in a file]]
  - [[#restore-last-opened-file][Restore last opened file]]
  - [[#maximize-new-buffers][Maximize new buffers]]
  - [[#save-mini-buffer-history][Save mini buffer history]]
  - [[#never-loose-the-cursor][Never loose the cursor]]
  - [[#visual-bell][Visual bell]]
  - [[#make-esc-quit-prompts][Make ESC quit prompts]]
  - [[#turn-off-line-wrapping][Turn off line wrapping]]
  - [[#update-build-it-packages][Update build it packages]]
  - [[#smooth-scrolling][Smooth scrolling]]
- [[#save-everything-every-where-all-the-time][Save everything, every where all the time]]
- [[#detect-file-change-outside-of-emacs][Detect file change outside of Emacs]]
- [[#the-famous-which-key-package][The famous which-key package]]
- [[#package-for-easier-key-bindings][Package for easier key bindings]]
- [[#relative-line-numbers][Relative line numbers]]
- [[#icons-for-various-packages][Icons for various packages]]
- [[#on-the-fly-syntax-checking][On the fly syntax checking]]
- [[#flymake][Flymake]]
- [[#tree-sitter][Tree-sitter]]
- [[#org-mode][Org Mode]]
  - [[#auto-indentation-org-mode-style][Auto indentation Org Mode style]]
  - [[#various-little-settings-1][Various little settings]]
  - [[#org-modern][Org Modern]]
  - [[#enable-table-of-contents][Enable table of contents]]
  - [[#org-blocks-snippets][Org blocks snippets]]
  - [[#shortcut-for-save-and-tangle][Shortcut for save and tangle]]
  - [[#enumerate-headings][Enumerate headings]]
  - [[#images-inlining][Images inlining]]
- [[#restarting-emacs-from-emacs][Restarting Emacs from Emacs]]
- [[#font-and-ligatures][Font and ligatures]]
  - [[#font-settings][Font settings]]
  - [[#ligatures][Ligatures]]
- [[#dooms-mode-line][Doom's mode line]]
- [[#doom-one-theme][Doom One theme]]
- [[#scrolling][Scrolling]]
  - [[#disable-half-page-jumping][Disable half page jumping]]
  - [[#how-many-lines-at-a-time][How many lines at a time]]
  - [[#accelerate-scrolling][Accelerate scrolling]]
  - [[#scroll-window-under-mouse][Scroll window under mouse]]
- [[#debugging-the-config-file][Debugging the config file]]
- [[#undo-history-persistence][Undo history persistence]]
- [[#beautify][Beautify]]
- [[#projectile][Projectile]]
- [[#neotree][Neotree]]
- [[#dashboard---welcome-screen][Dashboard - welcome screen]]
- [[#evil-mode][Evil mode]]
  - [[#evil-itself][Evil itself]]
  - [[#evil-org][Evil org]]
  - [[#evil-collection][Evil collection]]
  - [[#evil-surround][Evil surround]]
  - [[#evil-goggles][Evil goggles]]
  - [[#evil-commentary][Evil commentary]]
  - [[#leader-key][Leader key]]
  - [[#search-behavior][Search behavior]]
  - [[#disable-the-arrow-keys][Disable the arrow keys]]
- [[#performance-tweaks][Performance tweaks]]
  - [[#startup][Startup]]
  - [[#runtime][Runtime]]
- [[#compilation-mode][Compilation mode]]
- [[#magit][Magit]]
- [[#languages][Languages]]
  - [[#haskell][Haskell]]
  - [[#nix][Nix]]
  - [[#elisp][Elisp]]
  - [[#rust][Rust]]
  - [[#yaml][Yaml]]
  - [[#markdown][Markdown]]
- [[#ivy][Ivy]]
- [[#snippets][Snippets]]
- [[#completion][Completion]]
- [[#lsp][LSP]]
  - [[#general-lsp-config][General LSP config]]
  - [[#key-bindings][Key bindings]]
- [[#git-auto-file-saver][Git auto file saver]]
- [[#git-modes][Git modes]]
- [[#emojis-support][Emojis support]]
- [[#mouse-support-in-terminal-emacs][Mouse support in terminal Emacs]]
- [[#displays-the-actual-color-of-a-hex-value-color][Displays the actual color of a hex value color]]
- [[#spell-checking][Spell checking]]
  - [[#using-flycheck-aspell][Using flycheck-aspell]]
  - [[#using-flyspell][Using Flyspell]]
- [[#better-elisp-help][Better Elisp help]]
- [[#brackets-colorization][Brackets colorization]]
- [[#better-term-mode-colors][Better term-mode colors]]
- [[#dired][Dired]]
- [[#git-status-on-the-fringe][Git status on the fringe]]
- [[#pretty-symbols][Pretty symbols]]
- [[#cool-auto-indenting][Cool auto indenting]]
- [[#dim-irrelevant-buffers][Dim irrelevant buffers]]
- [[#todos][TODOs]]
  - [[#highlighting][Highlighting]]
  - [[#list-of-all-todos][List of all TODOs]]
- [[#slides-in-org-mode][Slides in Org Mode]]
- [[#games][Games]]

** Path to the custom file
#+begin_src emacs-lisp
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file 'noerror)
#+end_src
** Set up package.el to work with various sources
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives '(("elpa" . "https://elpa.gnu.org/packages/")
                           ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                           ("melpa" . "https://melpa.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src
** Install use-package
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (setq use-package-always-ensure t)
#+end_src
** Packages auto updates
#+begin_src emacs-lisp
(use-package auto-package-update
:config
(auto-package-update-maybe)
:ensure t)
#+end_src
* Various little settings
** Disable all the GUI stuff.
#+begin_src emacs-lisp
  (menu-bar-mode -1) 
  (tool-bar-mode -1) 
  (scroll-bar-mode -1) 
  (setq-default frame-title-format nil)
  (setq frame-resize-pixelwise nil)
#+end_src
** Save last place in a file
#+begin_src emacs-lisp
(save-place-mode 1)
(setq desktop-load-locked-desktop nil)
#+end_src
** Restore last opened file
#+begin_src emacs-lisp
  ;; (setq desktop-save t)
  ;; ;; (setq desktop-path '("~/.emacs.d/desktop/")) 
  ;; (setq desktop-restore-frames t)
  ;; (desktop-save-mode 1)
#+end_src
** Maximize new buffers
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src
** Save mini buffer history
#+begin_src emacs-lisp
(savehist-mode 1)
#+end_src
** Never loose the cursor
#+begin_src emacs-lisp
(use-package beacon
:ensure t)
(beacon-mode 1) 
#+end_src
** Visual bell
#+begin_src emacs-lisp
  (setq visible-bell t)
#+end_src
** Make ESC quit prompts
#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src
** Turn off line wrapping
#+begin_src emacs-lisp
  (set-default 'truncate-lines t)
#+end_src
** Update build it packages
#+begin_src emacs-lisp
  (setq package-install-upgrade-built-in t)
 #+end_src
** Smooth scrolling
Does not seems to be working.
#+begin_src emacs-lisp
  (setq pixel-scroll-precision-mode t)
 #+end_src
* Save everything, every where all the time
#+begin_src emacs-lisp
  (use-package super-save
    :config
    (super-save-mode +1))
  (setq super-save-auto-save-when-idle t)
#+end_src
* Detect file change outside of Emacs
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
  (setq global-auto-revert-non-file-buffers t)
#+end_src
* The famous which-key package
#+begin_src emacs-lisp
  (use-package which-key
      :config
      (which-key-mode))
#+end_src
* Package for easier key bindings
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-evil-setup t))
#+end_src
* Relative line numbers
#+begin_src emacs-lisp
  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'visual)
  ;; (add-to-list 'focus-in-hook (lambda () (setq display-line-numbers-type 'visual)))
  ;; (add-to-list 'focus-out-hook (lambda () (setq display-line-numbers-type t)))

  ;; (add-hook 'focus-in-hook (lambda () (message "Emacs is gainging focus...")))
  ;; (add-hook 'focus-out-hook (lambda () (message "Emacs is losing focus...")))
#+end_src
* Icons for various packages
#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+end_src
Run the following manually once:
#+begin_src emacs-lisp
  ;; (all-the-icons-install-fonts)
#+end_src
* On the fly syntax checking
Deprecating in favor of the build in Flymake.
# Uses external tools to do its work.
# In Haskell's case for example it will use [[https://github.com/ndmitchell/hlint][hlint]].
# #+begin_src emacs-lisp
#   (use-package flycheck
#     :init (global-flycheck-mode))
#   (add-hook 'after-init-hook #'global-flycheck-mode)
#   (setq flycheck-display-errors-delay 0)

#   (use-package flycheck-haskell)
#   (add-hook 'haskell-mode-hook #'flycheck-haskell-setup)

#   ;; (use-package flycheck-inline)
#   ;; (global-flycheck-inline-mode)
# #+end_src
* Flymake
This is a build-in thingy in Emacs.
#+begin_src emacs-lisp
  (setq flymake-no-changes-timeout 0.1)
#+end_src
* Tree-sitter
TODO: it is now a built in thingy in Emacs. But I cant find the official documentation.
#+begin_src emacs-lisp
  (use-package tree-sitter)
  (use-package tree-sitter-langs)
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
#+end_src
* Org Mode
** Auto indentation Org Mode style
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (setq org-startup-indented t)
#+end_src
# ** Org modern indent
# #+begin_src emacs-lisp
#   (setq org-startup-indented t)
#   (use-package org-modern-indent
#     :load-path "~/repos/org-modern-indent/"
#     :config ; add late to hook
#   (add-hook 'org-mode-hook #'org-modern-indent-mode 90))
#   #+end_src
** Various little settings
#+begin_src emacs-lisp
  (setq org-src-preserve-indentation nil
        org-src-tab-acts-natively t
        org-src-fontify-natively t
        org-hide-emphasis-markers t
        org-agenda-tags-column 0
        org-pretty-entities t
        org-ellipsis "…"
        org-confirm-babel-evaluate nil
        org-edit-src-content-indentation 2
        org-catch-invisible-edits 'show-and-error)
#+end_src
** Org Modern
#+begin_src emacs-lisp
  (use-package org-modern)
  (setq ;org-modern-hide-stars t
        org-modern-star 'replace)
  (global-org-modern-mode)
#+end_src
If needed, this will tell ~org-modern~ to leave org tables as is:
#+begin_src emacs-lisp
  ;; (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  ;; (custom-set-variables '(org-modern-table nil))
#+end_src
** Enable table of contents
#+begin_src emacs-lisp
  (use-package toc-org
    :init
    (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src
