home-manager/emacs-config.el
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file 'noerror)

(use-package beacon
:ensure t)
(beacon-mode 1)

(setq org-src-preserve-indentation nil
      org-src-tab-acts-natively t
      org-src-fontify-natively t
      org-hide-emphasis-markers t
      org-agenda-tags-column 0
      org-pretty-entities t
      org-ellipsis "…"
      org-confirm-babel-evaluate nil
      org-edit-src-content-indentation 2
      org-catch-invisible-edits 'show-and-error)

(general-nmap
