home-manager/emacs-config.org
** Org blocks snippets
Tell use-package not to try to install org-tempo since it's already there - part of Org Mode.
#+begin_src emacs-lisp
  (use-package org-tempo
    :ensure nil)
#+end_src

Here are all the available snippets:
|------------------------+-----  --------------------------------- |
| Typing the below + TAB | Expands to ...                          |
|------------------------+-------------------------------  --------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |
|------------------------+-----------------------------------------|
Here are some templates:
#+begin_src emacs-lisp
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("ha" . "src haskell"))
#+end_src
** Shortcut for save and tangle
#+begin_src emacs-lisp
  (general-nmap
    "<leader>t" 'org-babel-tangle)
#+end_src
** Enumerate headings
#+begin_src emacs-lisp
  ;; (setq org-startup-numerated t)
#+end_src
** Images inlining
#+begin_src emacs-lisp
  (setq org-startup-with-inline-images t)
#+end_src
# ** Remap ~org-meta-return~
# #+begin_src emacs-lisp
#   (general-imap
#     "RET" 'org-meta-return)
# #+end_src
* Restarting Emacs from Emacs
#+begin_src emacs-lisp
  (use-package restart-emacs)
  (general-nmap
    "<leader>re" '(lambda ()
  		  (interactive)
  		  (save-some-buffers t)
  		  (org-babel-tangle)
  		  (restart-emacs)))
  (setq confirm-kill-processes nil)
#+end_src
* Font and ligatures
** Font settings
#+begin_src emacs-lisp
  (set-face-attribute 'default nil
                      :family "Fira Code" 
                      :height 130
                      :weight 'medium)
  (set-face-attribute 'variable-pitch nil
                      :font "Ubuntu"
                      :height 130
                      :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
                      :font "Fira Code"
                      :height 130
                      :weight 'medium)
#+end_src
** Ligatures
#+begin_src emacs-lisp
  (use-package ligature
    :load-path "path-to-ligature-repo"
    :config
    ;; Enable the "www" ligature in every possible major mode
    (ligature-set-ligatures 't '("www"))
    ;; Enable traditional ligature support in eww-mode, if the
    ;; `variable-pitch' face supports it
    (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
    ;; Enable all Cascadia and Fira Code ligatures in programming modes
    (ligature-set-ligatures '(prog-mode text-mode)
                            '(;; == === ==== => =| =>>=>=|=>==>> ==< =/=//=// =~
                              ;; =:= =!=
                              ("=" (rx (+ (or ">" "<" "|" "/" "~" ":" "!" "="))))
                              ;; ;; ;;;
                              (";" (rx (+ ";")))
                              ;; && &&&
                              ("&" (rx (+ "&")))
                              ;; !! !!! !. !: !!. != !== !~
                              ("!" (rx (+ (or "=" "!" "\." ":" "~"))))
                              ;; ?? ??? ?:  ?=  ?.
                              ("?" (rx (or ":" "=" "\." (+ "?"))))
                              ;; %% %%%
                              ("%" (rx (+ "%")))
                              ;; |> ||> |||> ||||> |] |} || ||| |-> ||-||
                              ;; |->>-||-<<-| |- |== ||=||
                              ;; |==>>==<<==<=>==//==/=!==:===>
                              ("|" (rx (+ (or ">" "<" "|" "/" ":" "!" "}" "\]"
                                              "-" "=" ))))
                              ;; \\ \\\ \/
                              ("\\" (rx (or "/" (+ "\\"))))
                              ;; ++ +++ ++++ +>
                              ("+" (rx (or ">" (+ "+"))))
                              ;; :: ::: :::: :> :< := :// ::=
                              (":" (rx (or ">" "<" "=" "//" ":=" (+ ":"))))
                              ;; // /// //// /\ /* /> /===:===!=//===>>==>==/
                              ("/" (rx (+ (or ">"  "<" "|" "/" "\\" "\*" ":" "!"
                                              "="))))
                              ;; .. ... .... .= .- .? ..= ..<
                              ("\." (rx (or "=" "-" "\?" "\.=" "\.<" (+ "\."))))
                              ;; -- --- ---- -~ -> ->> -| -|->-->>->--<<-|
                              ("-" (rx (+ (or ">" "<" "|" "~" "-"))))
                              ;; *> */ *)  ** *** ****
                              ("*" (rx (or ">" "/" ")" (+ "*"))))
                              ;; www wwww
                              ("w" (rx (+ "w")))
                              ;; <> <!-- <|> <: <~ <~> <~~ <+ <* <$ </  <+> <*>
                              ;; <$> </> <|  <||  <||| <|||| <- <-| <-<<-|-> <->>
                              ;; <<-> <= <=> <<==<<==>=|=>==/==//=!==:=>
                              ;; << <<< <<<<
                              ("<" (rx (+ (or "\+" "\*" "\$" "<" ">" ":" "~"  "!"
                                              "-"  "/" "|" "="))))
                              ;; >: >- >>- >--|-> >>-|-> >= >== >>== >=|=:=>>
                              ;; >> >>> >>>>
                              (">" (rx (+ (or ">" "<" "|" "/" ":" "=" "-"))))
                              ;; #: #= #! #( #? #[ #{ #_ #_( ## ### #####
                              ("#" (rx (or ":" "=" "!" "(" "\?" "\[" "{" "_(" "_"
                                           (+ "#"))))
                              ;; ~~ ~~~ ~=  ~-  ~@ ~> ~~>
                              ("~" (rx (or ">" "=" "-" "@" "~>" (+ "~"))))
                              ;; __ ___ ____ _|_ __|____|_
                              ("_" (rx (+ (or "_" "|"))))
                              ;; Fira code: 0xFF 0x12
                              ("0" (rx (and "x" (+ (in "A-F" "a-f" "0-9")))))
                              ;; Fira code:
                              "Fl"  "Tl"  "fi"  "fj"  "fl"  "ft"
                              ;; The few not covered by the regexps.
                              "{|"  "[|"  "]#"  "(*"  "}#"  "$>"  "^="))
    ;; Enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t)
    :ensure t)
#+end_src
* Doom's mode line
#+begin_src emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode 1))
  ;; (setq doom-modeline-minor-modes t)
  (column-number-mode)
#+end_src
* Doom One theme
#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    (load-theme 'doom-one t)
    (doom-themes-visual-bell-config)
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    (doom-themes-treemacs-config)
    (doom-themes-org-config))
#+end_src
* Scrolling
** Disable half page jumping
Value greater than 100 gets rid of half page jumping.
#+begin_src emacs-lisp
  (setq scroll-conservatively 101)
#+end_src
** How many lines at a time
#+begin_src emacs-lisp
  (setq mouse-wheel-scroll-amount '(3 ((shift) . 3))) 
#+end_src
** Accelerate scrolling
#+begin_src emacs-lisp
  (setq mouse-wheel-progressive-speed t) 
#+end_src
** Scroll window under mouse
#+begin_src emacs-lisp
  (setq mouse-wheel-follow-mouse 't)
#+end_src
* Debugging the config file
This is the package.
#+begin_src emacs-lisp
  (use-package bug-hunter) 
#+end_src
To use it, do the following: ~M-x bug-hunter-file~ and point to init.el and not emacs-config.org.
* Undo history persistence
#+begin_src emacs-lisp
  (use-package undohist
    :config
    (undohist-initialize))
#+end_src
* Beautify
#+begin_src emacs-lisp
  (use-package page-break-lines)
  (global-page-break-lines-mode)
#+end_src
* Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :config
    (projectile-global-mode 1)
    :ensure t)
  (setq projectile-enable-caching t)
#+end_src
* Neotree
#+begin_src emacs-lisp
  (use-package neotree)
  (setq-default neo-show-hidden-files t)
  (setq neo-theme 'icons)
  (setq neo-window-fixed-size nil)
  (setq neo-window-width 27)
#+end_src
Every time when the neotree window is opened, let it find current file and jump to node.
#+begin_src emacs-lisp
  (setq neo-smart-open t)
#+end_src
When running ‘projectile-switch-project’ (C-c p p), ‘neotree’ will change root automatically.
#+begin_src emacs-lisp
  (setq projectile-switch-project-action 'neotree-projectile-action)
#+end_src
* Dashboard - welcome screen
#+begin_src emacs-lisp
  (use-package dashboard
    :config
    (dashboard-setup-startup-hook))
  (setq dashboard-projects-backend 'projectile)
  (setq dashboard-items '((recents . 9)
                          (projects . 9)
                          (agenda . 9)
                          (bookmarks . 3)
                          (registers . 3)))
  (setq dashboard-center-content t)
  (setq dashboard-show-shortcuts nil)
  (setq dashboard-icon-type 'all-the-icons) 
  ;; (setq dashboard-set-heading-icons t)
  ;; (setq dashboard-set-file-icons t)
#+end_src
This setting ensures that emacsclient always opens on dashboard rather than scratch.
#+begin_src emacs-lisp
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src
* Evil mode
** Evil itself
#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-keybinding nil)
    (evil-mode))
  (evil-set-undo-system 'undo-redo)
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd ":") 'evil-repeat-find-char)
    (define-key evil-motion-state-map (kbd ";") 'evil-ex))
#+end_src
** Evil org
#+begin_src emacs-lisp
  (use-package evil-org
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
#+end_src
