home-manager/emacs-config.org
** Evil collection
#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src
** Evil surround
#+begin_src emacs-lisp
  (use-package evil-surround
    :config
    (global-evil-surround-mode 1))
#+end_src
** Evil goggles
#+begin_src emacs-lisp
  (use-package evil-goggles
    :config
    (evil-goggles-mode))
  ;; (evil-goggles-use-diff-faces)
#+end_src
** Evil commentary
#+begin_src emacs-lisp
  (use-package evil-commentary
    :config
    (evil-commentary-mode))
  (general-nmap
    "<leader>c" 'evil-commentary-line)
  (general-vmap
    "<leader>c" 'evil-commentary)
#+end_src
** Leader key
#+begin_src emacs-lisp
  (evil-set-leader nil (kbd "SPC"))
#+end_src
** Search behavior
#+begin_src emacs-lisp
  (evil-select-search-module 'evil-search-module 'evil-search)
  (general-nmap
    "<leader>SPC" 'evil-ex-nohighlight)
#+end_src
** Disable the arrow keys
#+begin_src emacs-lisp
  (evil-define-key 'normal global-map (kbd "<up>") 'ignore)
  (evil-define-key 'normal global-map (kbd "<down>") 'ignore)
  (evil-define-key 'normal global-map (kbd "<left>") 'ignore)
  (evil-define-key 'normal global-map (kbd "<right>") 'ignore)
  (evil-define-key 'insert global-map (kbd "<up>") 'ignore)
  (evil-define-key 'insert global-map (kbd "<down>") 'ignore)
  (evil-define-key 'insert global-map (kbd "<left>") 'ignore)
  (evil-define-key 'insert global-map (kbd "<right>") 'ignore)
  (evil-define-key 'visual global-map (kbd "<up>") 'ignore)
  (evil-define-key 'visual global-map (kbd "<down>") 'ignore)
  (evil-define-key 'visual global-map (kbd "<left>") 'ignore)
  (evil-define-key 'visual global-map (kbd "<right>") 'ignore)
#+end_src
* Performance tweaks
** Startup
Using garbage magic hack.
#+begin_src emacs-lisp
  (use-package gcmh
    :config
    (gcmh-mode 1))
#+end_src
Setting garbage collection threshold.
#+begin_src emacs-lisp
  (setq gc-cons-threshold 402653184
        gc-cons-percentage 0.6)

#+end_src
Profile emacs startup.
#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))
#+end_src
** Runtime
Dial the GC threshold back down so that garbage collection happens more frequently but in less time.
Make GC pauses faster by decreasing the threshold.
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 2 1000 1000))
#+end_src
* Compilation mode
#+begin_src emacs-lisp
  (add-hook
   'compilation-finish-functions
   'switch-to-buffer-other-window
   'compilation)

  (setq compilation-scroll-output 'first-error)

  (general-nmap compilation-mode-map
    "<escape>" '(lambda ()
  		(interactive)
  		(bury-buffer)
  		(delete-window (get-buffer-window (get-buffer "*compilation*")))))

  (setq compilation-auto-jump-to-first-error t)
#+end_src
* Magit
#+begin_src emacs-lisp
  (use-package magit)
#+end_src
* Languages
** Haskell
#+begin_src emacs-lisp
  (use-package haskell-mode)

  (general-nmap haskell-mode-map
    "<f5>" '(lambda ()
              (interactive)
              (save-some-buffers t)
              (setq-local haskell-compile-cabal-build-command "cabal build")
              (haskell-compile)))

  (general-nmap haskell-mode-map
    "<f7>" '(lambda ()
              (interactive)
              (save-some-buffers t)
              (setq-local haskell-compile-cabal-build-command "cabal test")
              (haskell-compile)))

  (general-nmap haskell-mode-map
    "<f10>" '(lambda ()
               (interactive)
               (projectile-run-async-shell-command-in-root "kitty -e cabal run")))

  (add-to-list 'display-buffer-alist
  	     (cons "\\*Async Shell Command\\*.*" (cons #'display-buffer-no-window nil)))

  ;; (defun compilation-exit-autoclose (status code msg)
  ;;   (when (and (eq status 'exit) (zerop code))
  ;;     (bury-buffer)
  ;;     (delete-window (get-buffer-window (get-buffer "*compilation*"))))
  ;;   (cons msg code))
  ;; (setq compilation-exit-message-function 'compilation-exit-autoclose)
#+end_src
** Nix
#+begin_src emacs-lisp
  (use-package nix-mode
    :hook (nix-mode . lsp-deferred))

  (use-package lsp-nix
    :ensure lsp-mode
    :after (lsp-mode)
    :demand t
    :custom
    (lsp-nix-nil-formatter ["nixpkgs-fmt"]))
#+end_src
** Elisp
#+begin_src emacs-lisp
  ;;(use-package parinfer-rust-mode
  ;;:hook emacs-lisp-mode
  ;;:init
  ;;(setq parinfer-rust-auto-download t))
  ;;(setq parinfer-rust-check-before-enable 'disabled)
#+end_src
For auto formatting:
#+begin_src emacs-lisp
  (use-package
    elisp-autofmt
    :commands (elisp-autofmt-mode elisp-autofmt-buffer)
    :config (setq elisp-autofmt-on-save-p 'always)
    :hook (emacs-lisp-mode . elisp-autofmt-mode))
#+end_src
** Rust
#+begin_src emacs-lisp
  (use-package rust-mode)
#+end_src
** Yaml
#+begin_src emacs-lisp
  (use-package yaml-mode)
  (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
  (add-to-list 'auto-mode-alist '("\\.yaml\\'" . yaml-mode))
  (add-hook 'yaml-mode-hook
            '(lambda ()
               (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
#+end_src
** Markdown
#+begin_src emacs-lisp
  (use-package markdown-mode
    :mode ("README\\.md\\'" . gfm-mode)
    :init (setq markdown-command "multimarkdown"))
#+end_src
* Ivy
Ivy is split into three packages: ivy, swiper and counsel.
By installing counsel, the other two are brought in as dependencies.
#+begin_src emacs-lisp
  (use-package counsel)
  (ivy-mode 1)
#+end_src
Here are some basic settings particularly useful for new Ivy users.
If you want, you can go without any customizations at all.
These settings are the most bang for the buck in terms of customization.
So users that typically don't like customize a lot are advised to look at
these settings first. 
#+begin_src emacs-lisp
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
#+end_src
Ivy-rich adds extra columns to a few of the Counsel commands to provide more information about each item.
#+begin_src emacs-lisp
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src
The below provides some helpful behavior for sorting Ivy completion candidates
based on how recently or frequently you select them. This can be especially
helpful when using M-x to run commands that you don’t have bound to a key but
still need to access occasionally.
#+begin_src emacs-lisp
  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions.
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))
#+end_src
* Snippets
#+begin_src emacs-lisp
  (use-package yasnippet)
  (yas-global-mode 1)
  (use-package yasnippet-snippets)
#+end_src
* Completion
#+begin_src emacs-lisp
  (use-package company)
  (add-hook 'after-init-hook 'global-company-mode)
  (use-package company-cabal)
  (add-to-list 'company-backends 'company-cabal)
#+end_src
A company front-end with icons.
#+begin_src emacs-lisp
  (use-package company-box
    :hook (company-mode . company-box-mode))
#+end_src
* LSP
** General LSP config
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook 'eglot-ensure)
  (add-hook 'gfm-mode-hook 'eglot-ensure)
  (add-hook 'yaml-mode-hook 'eglot-ensure)
  (setq eglot-confirm-server-initiated-edits nil)
#+end_src
** Key bindings
#+begin_src emacs-lisp
  (general-nmap "<leader>d" 'xref-find-definitions)
  (general-nmap "<leader>f" 'eglot-format-buffer)
  (general-nmap "<leader>a" 'eglot-code-actions)
  (general-nmap "<leader>h" 'eldoc-doc-buffer)
  ;; (general-nmap "<leader>r" 'eglot-rename)
#+end_src
* Git auto file saver
#+begin_src emacs-lisp
  (use-package git-auto-commit-mode)
  (setq-default gac-automatically-push-p t)
  (setq-default gac-automatically-add-new-files-p t)
#+end_src
* Git modes
#+begin_src emacs-lisp
  (use-package git-modes)
#+end_src
* Emojis support
#+begin_src emacs-lisp
  (use-package emojify
    :hook 
    (after-init . global-emojify-mode))
  (setq emojify-download-emojis-p t)
#+end_src
* Mouse support in terminal Emacs
#+begin_src emacs-lisp
  (xterm-mouse-mode 1)
#+end_src
* Displays the actual color of a hex value color
#+begin_src emacs-lisp
#+end_src
* Spell checking
** Using flycheck-aspell
#+begin_src emacs-lisp
  (use-package flycheck-aspell)
  (add-to-list 'flycheck-checkers 'tex-aspell-dynamic)
  (add-to-list 'flycheck-checkers 'markdown-aspell-dynamic)
  (add-to-list 'flycheck-checkers 'html-aspell-dynamic)
  (add-to-list 'flycheck-checkers 'xml-aspell-dynamic)
  (add-to-list 'flycheck-checkers 'nroff-aspell-dynamic)
  (add-to-list 'flycheck-checkers 'texinfo-aspell-dynamic)
  (add-to-list 'flycheck-checkers 'c-aspell-dynamic)
  (add-to-list 'flycheck-checkers 'mail-aspell-dynamic)
#+end_src
From the docs: For seamless Emacs Ispell integration, I recommend setting the following variables.
#+begin_src emacs-lisp
  (setq ispell-program-name "aspell")
  ;; I am not really if its needed at all.
  ;; (setq ispell-dictionary "en_US")
  (setq ispell-silently-savep t)
#+end_src
You may also want to advice ~spell-pdict-save~ to refresh flycheck when inserting new entries into your local dictionary. This way highlighting instantly updates when you add a previously unknown word.
#+begin_src emacs-lisp
  (advice-add #'ispell-pdict-save :after #'flycheck-maybe-recheck)
  (defun flycheck-maybe-recheck (_)
    (when (bound-and-true-p flycheck-mode)
      (flycheck-buffer)))
#+end_src
** Using Flyspell
#+begin_src emacs-lisp
  (use-package flyspell)
  (add-hook 'text-mode-hook 'flyspell-mode)
  (add-hook 'org-mode-hook 'flyspell-mode)
  (add-hook 'org-mode-hook 'flyspell-buffer)
  (add-hook 'prog-mode-hook 'flyspell-prog-mode)
#+end_src
This will help with Org Mode spell checking by skipping org mode syntax.
#+begin_src emacs-lisp
  (add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:"))
  (add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_SRC" . "#\\+END_SRC"))
#+end_src
A function and a key for adding a word to a dictionary:
#+begin_src emacs-lisp
  (defun my-save-word ()
    (interactive)
    (let ((current-location (point))
          (word (flyspell-get-word)))
      (when (consp word)    
        (flyspell-do-correct 'save nil (car word) current-location (cadr word) (caddr word) current-location))))
#+end_src
Vim like keybinding.
#+begin_src emacs-lisp
  (general-nmap
    "zg" 'my-save-word)
  (general-nmap
    "z=" 'flyspell-correct-word-before-point)
#+end_src
* Better Elisp help
#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src
* Brackets colorization
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
