home-manager/emacs-config.org
* Better term-mode colors
The eterm-256color package enhances the output of term-mode to enable handling of a wider range of color codes so that many popular terminal applications look as you would expect them to. Keep in mind that this package requires ncurses to be installed on your machine so that it has access to the tic program. Most Linux distributions come with this program installed already so you may not have to do anything extra to use it.
#+begin_src emacs-lisp
  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))
#+end_src
* Dired
#+begin_src emacs-lisp
  (use-package dired
    :ensure nil)
  (use-package all-the-icons-dired)
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
#+end_src
* Git status on the fringe
#+begin_src emacs-lisp
  (use-package diff-hl)
  (global-diff-hl-mode)

  (diff-hl-dired-mode)
  (diff-hl-margin-mode)
  (diff-hl-flydiff-mode)
#+end_src
* Pretty symbols
#+begin_src emacs-lisp
  (defun my/org-mode/load-prettify-symbols ()
    (interactive)
    (setq prettify-symbols-alist
  	'(("lambda" . ?λ)))
    (prettify-symbols-mode 1))
  (add-hook 'org-mode-hook 'my/org-mode/load-prettify-symbols)
#+end_src
# * Cool auto indenting
# #+begin_src emacs-lisp
#   (use-package aggressive-indent)
#   (global-aggressive-indent-mode 1)
# #+end_src
# The variable aggressive-indent-dont-indent-if lets you customize when you don't want indentation to happen. For instance, if you think it's annoying that lines jump around in c++-mode because you haven't typed the ; yet, you could add the following clause:
# #+begin_src emacs-lisp
#   (add-to-list
#    'aggressive-indent-dont-indent-if
#    '(and (derived-mode-p 'c++-mode)
#          (null (string-match "\\([;{}]\\|\\b\\(if\\|for\\|while\\)\\b\\)"
#                              (thing-at-point 'line)))))
# #+end_src
* Dim irrelevant buffers
The ~solaire-mode~ package is an aesthetic plugin designed to visually distinguish "real" buffers (i.e. file-visiting code buffers where you do most of your work) from "unreal" buffers (like popups, sidebars, log buffers, terminals, etc) by giving the latter a slightly different -- often darker -- background.
#+begin_src emacs-lisp
  (use-package solaire-mode)
  (solaire-global-mode +1)
#+end_src
* TODOs
** Highlighting
#+begin_src emacs-lisp
  (use-package hl-todo)
  (global-hl-todo-mode)
#+end_src
** List of all TODOs
#+begin_src emacs-lisp
  (defun find-all-todos ()
    "Find all TODOs"
    (interactive)
    (projectile-grep "-- TODO"))

  (general-nmap "<leader>lt" 'find-all-todos)
#+end_src
* Slides in Org Mode
#+begin_src emacs-lisp
  (use-package moom
    :init (moom-mode 1))

  (use-package org-tree-slide
    :hook ((org-tree-slide-play . (lambda() (moom-toggle-frame-maximized)))
           (org-tree-slide-stop . (lambda() (moom-toggle-frame-maximized))))
    :custom
    (org-tree-slide-cursor-init)
    (org-image-actual-width nil))
  (general-nmap "<leader>p" 'org-tree-slide-mode)
  (general-nmap "<leader>vm" 'view-mode)
  (define-key org-tree-slide-mode-map (kbd "C-<down>") 'org-tree-slide-move-next-tree)
  (define-key org-tree-slide-mode-map (kbd "C-<up>") 'org-tree-slide-move-previous-tree)
#+end_src
This solves an issue with slide numbers in Doom mode line. Taken from here: https://github.com/takaxp/org-tree-slide/issues/65.
#+begin_src emacs-lisp
  (defun my-add-slide-number ()
    (add-to-list 'global-mode-string
                 '(:eval (concat "" (org-tree-slide--update-modeline) " "))))
  (defun my-remove-slide-number ()
    (setq global-mode-string
          (remove '(:eval (concat "" (org-tree-slide--update-modeline) " "))
                  global-mode-string)))
  (add-hook 'org-tree-slide-play-hook #'my-add-slide-number)
  (add-hook 'org-tree-slide-stop-hook #'my-remove-slide-number)
#+end_src
* Games
#+begin_src emacs-lisp
#+end_src
