home-manager/emacs-config.el

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(use-package diff-hl)
(global-diff-hl-mode)

(diff-hl-dired-mode)
(diff-hl-margin-mode)
(diff-hl-flydiff-mode)

(use-package hl-todo)
(global-hl-todo-mode)

(defun find-all-todos ()
  "Find all TODOs"
  (interactive)
  (projectile-grep "-- TODO"))

(general-nmap "<leader>lt" 'find-all-todos)

(defun my-add-slide-number ()
  (add-to-list 'global-mode-string
               '(:eval (concat "" (org-tree-slide--update-modeline) " "))))
(defun my-remove-slide-number ()
  (setq global-mode-string
        (remove '(:eval (concat "" (org-tree-slide--update-modeline) " "))
                global-mode-string)))
(add-hook 'org-tree-slide-play-hook #'my-add-slide-number)
(add-hook 'org-tree-slide-stop-hook #'my-remove-slide-number)


